app/views/items/index.html.haml

        = label :item, :status, 'Status', class: "new-item-label"
        = select :item, :status, @all_status.each {|t| [t.capitalize, t ] }, {}, {class: "new-item-input"}
---
SELECT "items".* FROM "items"