app/controllers/items_controller.rb

SELECT "items".* FROM "items"
---
  def index
    get_inv_params
    @items =  Item.order(@sort_by).page(params[:page]).per(20)

INSERT INTO "items" ("created_at", "kind", "name", "price", "quantity", "status", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @item = Item.new(params[:item])
    if @item.valid?
      @item.save